testdata/IN_2023_02/TM/VBL/SKV/SKV_Erw_garRS_Psych_EH_2023_02b.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <tarif:getQuote xmlns:allg="http://www.bipro.net/namespace/allgemein" xmlns:basis="http://www.bipro.net/namespace/basis" xmlns:dt="http://www.bipro.net/namespace/datentypen" xmlns:fragen="http://www.bipro.net/namespace/fragen" xmlns:gevo="http://www.bipro.net/namespace/gevo" xmlns:kapanl-basis="http://www.bipro.net/namespace/kapitalanlage/basis" xmlns:nachr="http://www.bipro.net/namespace/nachrichten" xmlns:partner="http://www.bipro.net/namespace/partner" xmlns:pm="http://www.bipro.net/namespace/produktmodell" xmlns:pm-leben="http://www.bipro.net/namespace/versicherung/produktmodell/leben" xmlns:tarif="http://www.bipro.net/namespace/versicherung/tarifierung" xmlns:vb-leben="urn:de:vb:bipro:taa:leben:1.12" xmlns:vbl="urn:de:vb:bipro:taa:vbl:1.12" xmlns:vs-pm="http://www.bipro.net/namespace/versicherung/produktmodell" xmlns:xmime="http://www.w3.org/2005/05/xmlmime" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
         
      <tarif:Request>
              
        <nachr:BiPROVersion>2.4.6.1.12</nachr:BiPROVersion>
        <nachr:ConsumerID>WS DEV TEAM</nachr:ConsumerID>
              
        <tarif:Tarifierung>
                   
          <gevo:Vermittler>
                        
            <allg:PartnerID>1500214430</allg:PartnerID>
                        
            <allg:Vermittlerrolle>
                             
              <allg:ArtID>01</allg:ArtID>
                             
              <allg:Vermittlertyp>01</allg:Vermittlertyp>
                          
            </allg:Vermittlerrolle>
                     
          </gevo:Vermittler>
                   
          <tarif:Partner xsi:type="partner:CT_JuristischePerson">
                        
            <partner:PartnerID>1500214430</partner:PartnerID>
                     
          </tarif:Partner>
                   
          <tarif:Partner xsi:type="partner:CT_Person">
                        
            <basis:Erweiterung xsi:type="vb-leben:CT_PersonErweiterung"/>
                        
            <partner:Anrede>1</partner:Anrede>
                        
            <partner:PartnerID>1963592160</partner:PartnerID>
                        
            <partner:Anschrift>
                             
              <allg:Landname>Deutschland</allg:Landname>
                             
              <partner:ArtID>1</partner:ArtID>
                          
            </partner:Anschrift>
                        
            <partner:ZusaetzlichePartnerdaten xsi:type="pm-leben:CT_Risikopruefung"/>
                        
            <partner:Geburtsdatum>1990-01-01</partner:Geburtsdatum>
                        
            <partner:Geschlecht>1</partner:Geschlecht>
                        
            <partner:Berufstaetigkeit>
                             
              <basis:Erweiterung xsi:type="vb-leben:CT_BerufstaetigkeitErweiterung">
                                  
                <vb-leben:ExistenzBerufsklasse>A</vb-leben:ExistenzBerufsklasse>
                               
              </basis:Erweiterung>
                             
              <partner:Beruf>Bankkaufmann</partner:Beruf>
                          
            </partner:Berufstaetigkeit>
                        
            <partner:Einkommen>
                             
              <partner:AnzahlGehaelterProJahr>12.0</partner:AnzahlGehaelterProJahr>
                             
              <partner:Einkommen/>
                          
            </partner:Einkommen>
                     
          </tarif:Partner>
                   
          <tarif:Versicherungsnehmer>
                        
            <partner:PartnerID>1963592160</partner:PartnerID>
                     
          </tarif:Versicherungsnehmer>
                   
          <tarif:Verkaufsprodukt>
                        
            <basis:Erweiterung xsi:type="vb-leben:CT_VerkaufsproduktErweiterung">
                             
              <vb-leben:Konsortium>Ohne</vb-leben:Konsortium>
                          
            </basis:Erweiterung>
                        
            <pm:Produkt xsi:type="pm-leben:CT_Produkt">
                             
              <basis:Erweiterung xsi:type="vb-leben:CT_ProduktErweiterung">
                                  
                <vb-leben:Tarifgruppe>Normal</vb-leben:Tarifgruppe>
                               
              </basis:Erweiterung>
                             
              <pm:GewuenschteZahlungsweise>8</pm:GewuenschteZahlungsweise>
                             
              <pm:Beitrag>
                                  
                <pm:ArtID xsi:type="dt:STE_BeitragBasis">01</pm:ArtID>
                                  
                <pm:Zahlungsweise>8</pm:Zahlungsweise>
                               
              </pm:Beitrag>
                             
              <pm:Versicherungsdauer>
                                  
                <allg:Beginn>2023-03-01T12:00</allg:Beginn>
                               
              </pm:Versicherungsdauer>
                             
              <pm:Kennung>SKV</pm:Kennung>
                             
              <pm:Elementarprodukt xsi:type="pm-leben:CT_ArbeitskraftAbsicherung">
                                  
                <basis:Erweiterung xsi:type="vb-leben:CT_ArbeitskraftAbsicherungErweiterung">
                                       
                  <vb-leben:NachversicherungsgarantieBU>2000</vb-leben:NachversicherungsgarantieBU>
                                    
                </basis:Erweiterung>
                                  
                <pm:Versicherungsdauer>
                                       
                  <allg:AnzahlJahre>34</allg:AnzahlJahre>
                                       
                  <allg:AnzahlMonate>1</allg:AnzahlMonate>
                                    
                </pm:Versicherungsdauer>
                                  
                <pm:Dynamik>
                                       
                  <pm:ArtID xsi:type="dt:STE_DynamikBasis">06</pm:ArtID>
                                       
                  <pm:Frequenz xsi:type="dt:STE_FrequenzBasis">jaehrlich</pm:Frequenz>
                                       
                  <pm:KategorieID>Leistung</pm:KategorieID>
                                    
                </pm:Dynamik>
                                  
                <vs-pm:VersicherungssummeOderLeistung>
                                       
                  <vs-pm:ArtID xsi:type="dt:STE_VersicherungssummeOderLeistungBasis">GarantierteRente</vs-pm:ArtID>
                                       
                  <vs-pm:Wert>1000</vs-pm:Wert>
                                       
                  <vs-pm:Werteinheit>20</vs-pm:Werteinheit>
                                       
                  <vs-pm:Waehrung>EUR</vs-pm:Waehrung>
                                       
                  <vs-pm:Auszahlungsweise>8</vs-pm:Auszahlungsweise>
                                       
                  <vs-pm:GarantierteErhoehung>
                                            
                    <pm:ArtID xsi:type="dt:STE_DynamikBasis">01</pm:ArtID>
                                            
                    <pm:Frequenz xsi:type="dt:STE_FrequenzBasis">jaehrlich</pm:Frequenz>
                                            
                    <pm:Wert>2.0</pm:Wert>
                                            
                    <pm:KategorieID>Leistung</pm:KategorieID>
                                         
                  </vs-pm:GarantierteErhoehung>
                                    
                </vs-pm:VersicherungssummeOderLeistung>
                                  
                <vs-pm:VersicherungssummeOderLeistung>
                                       
                  <basis:Erweiterung xsi:type="vb-leben:CT_Einmalleistung">
                                            
                    <vb-leben:EinmalleistungErsteHilfe>true</vb-leben:EinmalleistungErsteHilfe>
                                         
                  </basis:Erweiterung>
                                       
                  <vs-pm:ArtID xsi:type="vb-leben:STE_VersicherungssummeOderLeistungErweitert">Monatsrente12Fach</vs-pm:ArtID>
                                       
                  <vs-pm:Werteinheit>20</vs-pm:Werteinheit>
                                       
                  <vs-pm:Waehrung>EUR</vs-pm:Waehrung>
                                       
                  <vs-pm:Auszahlungsweise>6</vs-pm:Auszahlungsweise>
                                    
                </vs-pm:VersicherungssummeOderLeistung>
                                  
                <vs-pm:Bezugsrecht>
                                       
                  <vs-pm:Leistungsfall>Erlebensfall</vs-pm:Leistungsfall>
                                       
                  <vs-pm:IndexBerechtigter>1</vs-pm:IndexBerechtigter>
                                    
                </vs-pm:Bezugsrecht>
                                  
                <vs-pm:Bezugsrecht>
                                       
                  <vs-pm:Leistungsfall>Todesfall</vs-pm:Leistungsfall>
                                       
                  <vs-pm:IndexBerechtigter>3</vs-pm:IndexBerechtigter>
                                    
                </vs-pm:Bezugsrecht>
                                  
                <pm-leben:IstHauptversicherung>true</pm-leben:IstHauptversicherung>
                                  
                <pm-leben:UeberschussverwendungVorLeistung xsi:type="dt:STE_UeberschussverwendungBasis">08</pm-leben:UeberschussverwendungVorLeistung>
                                  
                <pm-leben:VersichertePerson>
                                       
                  <partner:PartnerID>1963592160</partner:PartnerID>
                                    
                </pm-leben:VersichertePerson>
                                  
                <pm-leben:Art xsi:type="dt:STE_UnfaehigkeitsZusatzArtBasis">Rente</pm-leben:Art>
                                  
                <pm-leben:Auspraegung xsi:type="vb-leben:STE_UnfaehigkeitsZusatzAuspraegungErweitert">KV</pm-leben:Auspraegung>
                               
              </pm:Elementarprodukt>
                             
              <pm:Elementarprodukt xsi:type="pm-leben:CT_ArbeitskraftAbsicherung">
                                  
                <pm-leben:IstHauptversicherung>false</pm-leben:IstHauptversicherung>
                                  
                <pm-leben:VersichertePerson>
                                       
                  <partner:PartnerID>1963592160</partner:PartnerID>
                                    
                </pm-leben:VersichertePerson>
                                  
                <pm-leben:Art xsi:type="dt:STE_UnfaehigkeitsZusatzArtBasis">Rente</pm-leben:Art>
                                  
                <pm-leben:Auspraegung xsi:type="vb-leben:STE_UnfaehigkeitsZusatzAuspraegungErweitert">Psyche</pm-leben:Auspraegung>
                               
              </pm:Elementarprodukt>
                             
              <pm:Dynamik>
                                  
                <pm:KategorieID>Beitrag</pm:KategorieID>
                                  
                <pm:Hochrechnung>true</pm:Hochrechnung>
                               
              </pm:Dynamik>
                             
              <pm-leben:VorgabeBerechnung>
                                  
                <pm-leben:ArtID xsi:type="dt:STE_VorgabeBerechnungBasis">GarantierteRente</pm-leben:ArtID>
                                  
                <pm-leben:Kontext xsi:type="dt:STE_VorgabeBerechnungKontextBasis">ArbeitskraftAbsicherung</pm-leben:Kontext>
                               
              </pm-leben:VorgabeBerechnung>
                          
            </pm:Produkt>
                     
          </tarif:Verkaufsprodukt>
                
        </tarif:Tarifierung>
           
      </tarif:Request>
      
    </tarif:getQuote>
  </soapenv:Body>
</soapenv:Envelope>
